Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: Quarkus is an Open Source project licensed under the <a href="https://www.apache.org/licenses/LICENSE-2.0">Apache License version 2.0</a>. First and foremost, it is an open community where contributions, ideas and discussions are done in the open and contributors are welcome. Let’s join forces in building the future of Java applications.
es_es: Quarkus es un proyecto de código abierto con licencia <a href="https://www.apache.org/licenses/LICENSE-2.0">Licencia Apache versión 2.0</a>. Ante todo, es una comunidad abierta donde las contribuciones, ideas y discusiones se hacen en abierto y los colaboradores son bienvenidos. Unamos fuerzas para construir el futuro de las aplicaciones Java.

source: Quarkus is an Open Source project licensed under the https://www.apache.org/licenses/LICENSE-2.0[Apache License version 2.0].
es_es: Quarkus es un proyecto de código abierto con licencia https://www.apache.org/licenses/LICENSE-2.0[Licencia Apache versión 2.0].

source: Quarkus is an ecosystem made from many extensions and many libraries (like Eclipse Vert.x, Hibernate, Apache Camel and more), most of them not under the direct responsibility of the Quarkus team. If you find a security bug possibly rooted in one of these libraries, you can either disclose to them directly or disclose them to the Quarkus team (following this process) and we will responsibly disclose the issue to the respective extension or library maintainer.
es_es: Quarkus es un ecosistema hecho de muchas extensiones y muchas bibliotecas (como Eclipse Vert.x, Hibernate, Apache Camel y más), la mayoría de las cuales no están directamente bajo la responsabilidad directa del equipo de Quarkus. Si encuentra un error de seguridad en una de estas bibliotecas, puede comunicárselas directamente o al equipo de Quarkus (siguiendo este proceso) y divulgaremos el problema de manera responsable al mantenedor de la biblioteca o de la extensión respectiva.

source: Quarkus is an open ecosystem and we hope to see all the extensions people need to write their apps. We are working as we speak to allow an extension to be published in separate repos and separate GAVs and thus published in Maven repos independently of Quarkus core. This will greatly simplify the publication process. Expect news soon.
es_es: Quarkus es un ecosistema abierto y espera tener todas las extensiones que la gente necesita para crear aplicaciones. Estamos trabajando mientras hablamos para permitir que una extensión se publique en repositorios y GAV separados y por lo tanto se publique en repositorios Maven independientes del core de Quarkus. Esto simplificará enormemente el proceso de publicación. Espere noticias pronto.

source: Quarkus is designed to seamlessly combine the familiar imperative style code and the non-blocking, reactive style when developing applications.
es_es: Quarkus está diseñado para combinar a la perfección el familiar código de estilo imperativo y el estilo reactivo no bloqueante al desarrollar aplicaciones.

source: Quarkus is not just about being great for writing Web Applications or Micro-Services. We’re focusing on more than the feature set: we make sure that every feature works well, simply, with little to no configuration, in the most intuitive way possible. It should be trivial to develop simple things, and easy to develop the more complex ones.
es_es: Quarkus no se trata sólo de ser genial para escribir Aplicaciones Web o Micro-Servicios. Nos centramos en algo más que el conjunto de características: nos aseguramos de que cada característica funcione bien, simplemente, con poca o ninguna configuración, de la manera más intuitiva posible. Debería ser trivial desarrollar cosas simples, y fácil desarrollar las más complejas.

source: Quarkus is not limited to HTTP. You can use <a href="https://quarkus.io/guides/grpc-getting-started">gRPC</a> or <a href="https://quarkus.io/guides/smallrye-graphql">GraphQL</a>, two prominent alternatives in the microservice space.
es_es: Quarkus no se limita a HTTP. Puede utilizar <a href="https://quarkus.io/guides/grpc-getting-started">gRPC</a> o <a href="https://quarkus.io/guides/smallrye-graphql">GraphQL</a>, dos alternativas destacadas en el espacio de los microservicios.

source: Quarkus is published in Maven Central, check out link:/extensions[which extensions] you need and just import them in your `pom.xml` to get Quarkus. We recommend you start your Quarkus experience via our link:/get-started[Getting Started guides].
es_es: Quarkus es publicado en Maven Central, para obtener Quarkus consulte el link:/extensions[qué extensiones] y simplemente impórtelos en su `pom.xml`. Le recomendamos que comience su experiencia con Quarkus a través de nuestro link:/get-started[Guías de inicio].

source: Quarkus is stable?
es_es: ¿Quarkus es estable?

source: Quarkus is the rising star for Kube Native Java as it re-imagines the Java stack to give you the performance characteristics and developer experience you need to create modern, high performing applications. Quarkus helps you use your existing skills and code in new ways and greatly reduces the technical burden when moving to a Kubernetes-centric environment.
es_es: Quarkus es la estrella emergente de Kube Native Java, ya que reimagina la pila Java para ofrecerle las características de rendimiento y la experiencia de desarrollador que necesita para crear aplicaciones modernas y de alto rendimiento. Quarkus le ayuda a utilizar sus habilidades y código existentes de nuevas maneras y reduce en gran medida la carga técnica al pasar a un entorno centrado en Kubernetes.

source: Quarkus leverages SmallRye Health, an implementation of the MicroProfile Health specification. This allows applications to provide information about their state to external viewers in a Kubernetes environment where automated processes must be able to determine whether the application should be discarded or restarted. <a href="{{site.baseurl}}/guides/microprofile-health">Read the guide for more details.</a>
es_es: Quarkus aprovecha SmallRye Health, una implementación de la especificación MicroProfile Health. Esto permite que las aplicaciones proporcionen información sobre su estado a espectadores externos en un entorno Kubernetes en el que los procesos automatizados deben ser capaces de determinar si la aplicación debe ser descartada o reiniciada. <a href="{{site.baseurl}}/guides/microprofile-health">Lea la guía para obtener más detalles.</a>

source: Quarkus makes it easy to change your code on the fly. Let's modify the <a href="http://localhost:8080/hello">RESTful endpoint</a>
es_es: Quarkus facilita la modificación de su código sobre la marcha. Vamos a modificar el <a href="http://localhost:8080/hello">endpoint RESTful</a>

source: Quarkus makes it easy to deploy microservice applications to Kubernetes without having to understand the intricacies of the underlying Kubernetes framework. Extensions are available for Kubernetes, and Kubernetes distributions, to facilitate this process with only a minimal amount of configuration variables needed.
es_es: Quarkus facilita el despliegue de aplicaciones de microservicios en Kubernetes sin tener que entender las complejidades del marco subyacente de Kubernetes. Hay extensiones disponibles para Kubernetes, y distribuciones de Kubernetes, para facilitar este proceso con solo una cantidad mínima de variables de configuración necesarias.

source: Quarkus needs JDK 11, so we specify that first:
es_es: Quarkus necesita JDK 11, así que lo especificamos primero:

source: Quarkus offers unequaled performance
es_es: Quarkus ofrece un rendimiento inigualable

source: Quarkus on Kubernetes
es_es: Quarkus en Kubernetes

source: Quarkus only implements a subset of the CDI features and comes with non-standard features and specific APIS, you can learn more about it in the xref:cdi-reference.adoc[Contexts and Dependency Injection guide].
es_es: Quarkus sólo implementa un subconjunto de las características de CDI y viene con características no estándar y APIS específicas, puedes aprender más sobre esto en la xref:cdi-reference.adoc[Guía de contextos e inyección de dependencias].

source: Quarkus provides a cohesive, fun to use, full-stack framework by leveraging a growing list of hundreds of best-of-breed libraries that you love and use. All wired on a standard backbone.
es_es: Quarkus proporciona un marco de trabajo cohesivo, divertido de usar, completo, aprovechando una lista creciente de cientos de bibliotecas de primera clase que usted ama y usa. Todo conectado en una columna vertebral estándar.

source: Quarkus provides a cohesive, fun to use, full-stack framework by leveraging a growing list of over fifty best-of-breed libraries that you love and use. All wired on a standard backbone.
es_es: Quarkus proporciona un marco de trabajo cohesivo y divertido de usar, aprovechando una lista creciente de más de cincuenta librerías de primera línea que usted ama y usa. Todo conectado en una columna vertebral estándar.

source: Quarkus provides developers the tools and capabilities to troubleshoot distributed microservices applications in Kubernetes including tracing and debugging.
es_es: Quarkus proporciona a los desarrolladores las herramientas y capacidades para solucionar los problemas de las aplicaciones de microservicios distribuidos en Kubernetes, incluyendo el rastreo y la depuración.

source: Quarkus provides first class support for using Liquibase MongoDB Extension as will be explained in this guide.
es_es: Quarkus proporciona un soporte de primera clase para el uso de Liquibase MongoDB Extension como se explicará en esta guía.

source: Quarkus provides various configuration knobs under the `quarkus.spring-cloud-config` root. For the purposes of this guide, our Quarkus application is going to be configured in `application.properties` as follows:
es_es: Quarkus proporciona varios controles de configuración bajo la raíz `quarkus.spring-cloud-config`. Para los propósitos de esta guía, nuestra aplicación Quarkus va a ser configurada en `application.properties` como sigue:

source: Quarkus specific configuration
es_es: Configuración específica de Quarkus

source: Quarkus supports conditional extension dependencies. I.e. one Quarkus extension may declare one or more conditional dependencies on other Quarkus extensions. Conditional dependencies on and from non-extension artifacts aren't supported.
es_es: Quarkus admite las dependencias condicionales de las extensiones. Es decir, una extensión de Quarkus puede declarar una o más dependencias condicionales de otras extensiones de Quarkus. No se admiten dependencias condicionales en y desde artefactos que no sean extensiones.

source: Quarkus supports https://junit.org/junit5/[JUnit 5] tests.
es_es: Quarkus es compatible con las pruebas de https://junit.org/junit5/[JUnit 5].

source: Quarkus tailors your application for GraalVM and HotSpot. Amazingly fast boot time, incredibly low RSS memory (not just heap size!) offering near instant scale up and high density memory utilization in container orchestration platforms like Kubernetes. We use a technique we call compile time boot.
es_es: Quarkus adapta su aplicación para GraalVM y HotSpot. Un tiempo de arranque increíblemente rápido, una memoria RSS increíblemente baja (¡no solo el tamaño de la heap!) que ofrece un escalado casi instantáneo y una utilización de la memoria de alta densidad en plataformas de orquestación de contenedores como Kubernetes. Utilizamos una técnica que llamamos arranque en tiempo de compilación.

source: Quarkus utilizes <a href="https://opentracing.io/" target="_blank">OpenTracing</a> which is a vendor-agnostic API to help developers easily instrument tracing into their codebase. Distributed tracing helps pinpoint where failures occur and what causes poor performance. <a href="{{site.baseurl}}/guides/opentracing">Read the guide for more details.</a>
es_es: Quarkus utiliza <a href="https://opentracing.io/" target="_blank">OpenTracing</a>que es una API independiente del proveedor para ayudar a los desarrolladores a instrumentar fácilmente el rastreo en su código base. El rastreo distribuido ayuda a identificar dónde se producen los fallos y qué causa el bajo rendimiento. <a href="{{site.baseurl}}/guides/opentracing">Lea la guía para más detalles.</a>

source: Quarkus utilizes the <a href="https://micrometer.io/" target="_blank">Micrometer</a> metrics library for runtime and application metrics. It provides a simple facade for the most popular monitoring systems to instrument your JVM-based application code without vendor lock-in. Application-specific and built-in metrics can be exposed using Micrometer. <a href="{{site.baseurl}}/guides/micrometer#support-for-the-microprofile-metrics-api">Read the guide for more details.</a>
es_es: Quarkus utiliza la biblioteca de métricas <a href="https://micrometer.io/" target="_blank">Micrometer</a> para las métricas de tiempo de ejecución y de aplicación. Proporciona una fachada simple para los sistemas de monitoreo más populares para instrumentar su código de aplicación basado en JVM sin bloqueo de proveedor. Las métricas específicas de la aplicación y las incorporadas pueden ser expuestas usando Micrometer. <a href="{{site.baseurl}}/guides/micrometer#support-for-the-microprofile-metrics-api">Lea la guía para más detalles.</a>

source: Quarkus was built from the ground up for Kubernetes making it easy to deploy applications without having to understand all of the complexities of the platform. Quarkus allows developers to automatically generate Kubernetes resources including building and deploying container images without having to manually create YAML files.
es_es: Quarkus fue construido desde el principio para Kubernetes, facilitando el despliegue de aplicaciones sin tener que entender todas las complejidades de la plataforma. Quarkus permite a los desarrolladores generar automáticamente recursos de Kubernetes, incluyendo la construcción y el despliegue de imágenes de contenedores sin tener que crear manualmente archivos YAML.

source: Quarkus was created to enable Java developers to create applications for a modern, cloud-native world. Quarkus is a Kubernetes-native Java framework tailored for GraalVM and HotSpot, crafted from best-of-breed Java libraries and standards. The goal is to make Java the leading platform in Kubernetes and serverless environments while offering developers a framework to address a wider range of distributed application architectures.
es_es: Quarkus fue creado para permitir a los desarrolladores de Java crear aplicaciones para un mundo moderno y nativo de la nube. Quarkus es un marco Java nativo de Kubernetes adaptado a GraalVM y HotSpot, elaborado a partir de las mejores bibliotecas y estándares Java. El objetivo es convertir a Java en la plataforma líder en Kubernetes y entornos sin servidor, al tiempo que ofrece a los desarrolladores un marco para abordar una gama más amplia de arquitecturas de aplicaciones distribuidas.

source: Quarkus will start in development mode as normal, but down the bottom of the screen you should see the following:
es_es: Quarkus se iniciará en modo de desarrollo como es normal, pero en la parte inferior de la pantalla debería ver lo siguiente:

source: Quarkus will substitute `${database-name}` with the value obtained from the entry with name `database-name` of the `postgres` Secret. `somehost` is the name of the Kubernetes `Service` that was created when PostgreSQL was deployed to Kubernetes.
es_es: Quarkus sustituirá `${database-name}` por el valor obtenido de la entrada con nombre `database-name` del `postgres` Secret. `somehost` es el nombre del Kubernetes `Service` que se creó cuando se desplegó PostgreSQL en Kubernetes.

source: Quarkus will substitute `${database-password}` with the value obtained from the entry with name `database-password` of the `postgres` Secret.
es_es: Quarkus sustituirá `${database-password}` por el valor obtenido de la entrada con nombre `database-password` del `postgres` Secret.

source: Quarkus will substitute `${database-user}` with the value obtained from the entry with name `database-user` of the `postgres` Secret.
es_es: Quarkus sustituirá `${database-user}` por el valor obtenido de la entrada con nombre `database-user` del `postgres` Secret.

source: Quarkus's Collaborative Community Forum
es_es: Foro comunitario de colaboración de Quarkus

source: Querying capabilities
es_es: Capacidades de consulta

source: Quickly Bootstrap Your Application
es_es: Prepare rápidamente su aplicación

source: REST API
es_es: API REST

source: RESTEasy Reactive and its Jackson support to handle JSON payloads
es_es: RESTEasy Reactive y su soporte Jackson para manejar cargas útiles JSON

source: Re-augment a Quarkus Application
es_es: Volver a medir una aplicación de Quarkus

source: Re-augmentation is the process of recreating the augmentation output for a different build time configuration
es_es: La re-aumentación es el proceso de recrear la salida de aumento para una configuración de tiempo de construcción diferente

source: Reactive
es_es: Reactivo

source: Reactive Messaging AMQP 1.0 Connector Reference Documentation
es_es: Documentación de referencia del conector AMQP 1.0 de mensajería reactiva

source: Read about Cloud Events
es_es: Lea sobre los eventos en la nube

source: Read about the community plans for the future. Here is <a href="https://github.com/orgs/quarkusio/projects/5">our current roadmap</a>. This is driven by the community, come and tell us what <i>your</i> needs are.
es_es: Lea los planes de la comunidad para el futuro. Aquí está <a href="https://github.com/orgs/quarkusio/projects/5">nuestra hoja de ruta actual</a>. Esto es impulsado por la comunidad, ven y dinos cuáles son <i>tus</i> necesidades.

source: Read about xref:funqy.adoc[Funqy Basics]. This is a short read!
es_es: Lea sobre xref:funqy.html[los fundamentos de Funqy]. Esta es una lectura corta!

source: Read the Guide
es_es: Leer la guía

source: Reading properties from Spring Cloud Config Server
es_es: Lectura de propiedades del servidor de configuración de Spring Cloud

source: Receiving AMQP messages
es_es: Recepción de mensajes AMQP

source: Receiving Cloud Events
es_es: Recepción de eventos en la nube

source: Receiving quotes
es_es: Recepción de presupuestos

source: Recent download statistics for Adoptium distributions, from https://dash.adoptopenjdk.net/trends[dash.adoptopenjdk.net]
es_es: Estadísticas de descargas recientes de las distribuciones de Adoptium, de https://dash.adoptopenjdk.net/trends[dash.adoptopenjdk.net]

source: Red Hat Build of Quarkus
es_es: Compilación de Red Hat de Quarkus

source: Reduction in Reflection Usage
es_es: Reducción del uso de la reflexión

source: References
es_es: Referencias

source: Remote Development
es_es: Desarrollo a distancia

source: Remove the `src/main/resources/application.properties` and create a `src/main/resources/application.yaml` file.
es_es: Elimine el `src/main/resources/application.properties` y cree un archivo `src/main/resources/application.yaml`.

source: Report a Vulnerability
es_es: Informar de una vulnerabilidad

source: Reporting security issues
es_es: Reportando problemas de seguridad

source: Returns the stream (_Reactive Stream_)
es_es: Devuelve el flujo _(Reactive Stream_)

source: Roadmap
es_es: Hoja de ruta

source: Run <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">dev mode</a> remotely with changes to local files immediately available in a containerize environment.
es_es: Ejecutar <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">modo dev</a> de forma remota con los cambios en los archivos locales inmediatamente disponibles en un entorno de contenedores.

source: Run the Getting Started Application
es_es: Ejecutar la aplicación de inicio

source: Run the application as a native executable
es_es: Ejecutar la aplicación como un ejecutable nativo

source: Run the application with:
es_es: Ejecuta la aplicación con:

source: Run the demo
es_es: Ejecutar la demo

source: Run this script in your CLI:
es_es: Ejecute este script en su CLI:

source: Running Database migration scripts
es_es: Ejecución de scripts de migración de bases de datos

source: Running in JVM or Native mode
es_es: Ejecución en modo JVM o nativo

source: Running scheduled operations
es_es: Ejecución de operaciones programadas

source: Running the application
es_es: Ejecución de la aplicación

source: Runtime options, that may be adjusted after the application has been built but before it has been launched.
es_es: Opciones de tiempo de ejecución, que pueden ajustarse después de la construcción de la aplicación pero antes de su lanzamiento.

source: S2I Options
es_es: Opciones S2I

source: Scheduler
es_es: Planificador

source: Second, cacerts, the certificate store. You may need to periodically obtain an updated copy, also.
es_es: En segundo lugar, cacerts, el almacén de certificados. Es posible que tenga que obtener periódicamente una copia actualizada, también.

source: Secrets
es_es: Secretos

source: Security Testing
es_es: Pruebas de seguridad

source: Security implications
es_es: Implicaciones de seguridad

source: See xref:deploying-to-kubernetes.adoc#secret-mapping[this] for more details.
es_es: Vea xref:deploying-to-kubernetes.html#secret-mapping[esto] para más detalles.

source: See xref:security-openid-connect.adoc#integration-testing-security-annotation[OpenID Connect Bearer Token Integration testing], xref:security-openid-connect-web-authentication.adoc#integration-testing-security-annotation[OpenID Connect Authorization Code Flow Integration testing] and xref:security-jwt.adoc#integration-testing-security-annotation[SmallRye JWT Integration testing] for more details about testing the endpoint code which depends on the injected `JsonWebToken`.
es_es: Consulte las pruebas de xref:security-openid-connect.html#integration-testing-security-annotation[integración del token de portador de OpenID Connect], las xref:security-openid-connect-web-authentication.html#integration-testing-security-annotation[pruebas de integración del flujo de código de autorización de OpenID Connect] y xref:security-jwt.html#integration-testing-security-annotation[las pruebas de integración del JWT de SmallRye] para obtener más detalles sobre las pruebas del código del endpoint que depende del `JsonWebToken` inyectado.

source: Selected Filters
es_es: Filtros seleccionados

source: Selecting among multiple extensions
es_es: Seleccionar entre varias extensiones

source: Sending AMQP messages
es_es: Envío de mensajes AMQP

source: Sending Cloud Events
es_es: Envío de eventos en la nube

source: Sending quote request
es_es: Envío de solicitud de presupuesto

source: September 24, 2019
es_es: 24 de septiembre de 2019

source: Serialization
es_es: Serialización

source: Server configuration
es_es: Configuración del servidor

source: Server configuration example
es_es: Ejemplo de configuración del servidor

source: Session Abstracts
es_es: Resúmenes de las sesiones

source: Set durable to false
es_es: Establecer la durabilidad en falso

source: Setting the port
es_es: Ajuste del puerto

source: Setting up Knative
es_es: Configuración de Knative

source: Setting up and configuring MongoDB with Panache
es_es: Instalación y configuración de MongoDB con Panache

source: Setting up support for Liquibase
es_es: Configuración del soporte para Liquibase

source: Share in our excitement when the project receives <a href="{{site.baseurl}}/awards">awards and recognition</a> for all of the hard work done by the community.
es_es: Comparte nuestra emoción cuando el proyecto reciba <a href="{{site.baseurl}}/awards">premios y reconocimientos</a> por todo el trabajo duro realizado por la comunidad.

source: Shared Elasticsearch
es_es: Elasticsearch compartido
